[Killed] BlockStatement
src/gilded_rose.mjs:2:56
 export class Item {
-  constructor(name, sellIn, quality, conjured = false) {
-    this.name = name;
-    this.sellIn = sellIn;
-    this.quality = (this.name === "Sulfuras, Hand of Ragnaros") ? 80 : Math.min(Math.max(quality, 0), 50);
-    this.conjured = conjured;
-  }
+  constructor(name, sellIn, quality, conjured = false) {}
 }
 
killedBy: Gilded Rose shop can be initialised
statusReason: expected undefined to equal 'item'

[Killed] BooleanLiteral
src/gilded_rose.mjs:2:49
 export class Item {
-  constructor(name, sellIn, quality, conjured = false) {
+  constructor(name, sellIn, quality, conjured = true) {
     this.name = name;
     this.sellIn = sellIn;
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 8 to equal 9

[Killed] EqualityOperator
src/gilded_rose.mjs:5:21
   constructor(name, sellIn, quality, conjured = false) {
     this.name = name;
     this.sellIn = sellIn;
-    this.quality = (this.name === "Sulfuras, Hand of Ragnaros") ? 80 : Math.min(Math.max(quality, 0), 50);
+    this.quality = (this.name !== "Sulfuras, Hand of Ragnaros") ? 80 : Math.min(Math.max(quality, 0), 50);
     this.conjured = conjured;
   }
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 79 to equal 9

[Killed] ConditionalExpression
src/gilded_rose.mjs:5:21
   constructor(name, sellIn, quality, conjured = false) {
     this.name = name;
     this.sellIn = sellIn;
-    this.quality = (this.name === "Sulfuras, Hand of Ragnaros") ? 80 : Math.min(Math.max(quality, 0), 50);
+    this.quality = (false) ? 80 : Math.min(Math.max(quality, 0), 50);
     this.conjured = conjured;
   }
killedBy: Gilded Rose Sulfuras sell in and quality values never change
statusReason: expected 50 to equal 80

[Killed] BlockStatement
src/gilded_rose.mjs:15:25
     this.items = items;
   }
 
-  decrementSellIn(item) {
-    item.sellIn = item.sellIn - 1;
-  }
+  decrementSellIn(item) {}
 
   decrementQualityByAmount(item, amount) {
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 10 to equal 9

[Killed] ArithmeticOperator
src/gilded_rose.mjs:16:19
   }
 
   decrementSellIn(item) {
-    item.sellIn = item.sellIn - 1;
+    item.sellIn = item.sellIn + 1;
   }
 
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 11 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:19:42
     item.sellIn = item.sellIn - 1;
   }
 
-  decrementQualityByAmount(item, amount) {
-    item.quality = Math.max(item.quality - amount, 0);
-  }
+  decrementQualityByAmount(item, amount) {}
 
   incrementQualityByAmount(item, amount) {
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 10 to equal 9

[Killed] ArithmeticOperator
src/gilded_rose.mjs:20:29
   }
 
   decrementQualityByAmount(item, amount) {
-    item.quality = Math.max(item.quality - amount, 0);
+    item.quality = Math.max(item.quality + amount, 0);
   }
 
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 11 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:23:42
     item.quality = Math.max(item.quality - amount, 0);
   }
 
-  incrementQualityByAmount(item, amount) {
-    item.quality = Math.min(item.quality + amount, 50);
-  }
+  incrementQualityByAmount(item, amount) {}
 
   updateQuality() {
killedBy: Gilded Rose Aged Brie quality value increases by 1 per day
statusReason: expected 10 to equal 11

[Killed] ArithmeticOperator
src/gilded_rose.mjs:24:29
   }
 
   incrementQualityByAmount(item, amount) {
-    item.quality = Math.min(item.quality + amount, 50);
+    item.quality = Math.min(item.quality - amount, 50);
   }
 
killedBy: Gilded Rose Aged Brie quality value increases by 1 per day
statusReason: expected 9 to equal 11

[Killed] ConditionalExpression
src/gilded_rose.mjs:32:9
       const item = this.items[i];
 
       switch (item.name) {
-        case "Sulfuras, Hand of Ragnaros":
-          break;
+        case "Sulfuras, Hand of Ragnaros":
 
         case "Backstage passes to a TAFKAL80ETC concert":
killedBy: Gilded Rose Sulfuras sell in and quality values never change
statusReason: expected 50 to equal 80

[Killed] ConditionalExpression
src/gilded_rose.mjs:35:9
         case "Sulfuras, Hand of Ragnaros":
           break;
 
-        case "Backstage passes to a TAFKAL80ETC concert":
-          if (item.sellIn <= 0) item.quality = 0
-          else if (item.sellIn <= 5) this.incrementQualityByAmount(item, 3);
-          else if (item.sellIn <= 10) this.incrementQualityByAmount(item, 2);
-          else this.incrementQualityByAmount(item, 1);
-          break;
+        case "Backstage passes to a TAFKAL80ETC concert":
 
         case "Aged Brie":
killedBy: Gilded Rose Backstage passes quality increases by 2 per day when the sell in value is between 5 and 10
statusReason: expected 11 to equal 12

[Killed] ConditionalExpression
src/gilded_rose.mjs:36:15
           break;
 
         case "Backstage passes to a TAFKAL80ETC concert":
-          if (item.sellIn <= 0) item.quality = 0
+          if (false) item.quality = 0
           else if (item.sellIn <= 5) this.incrementQualityByAmount(item, 3);
           else if (item.sellIn <= 10) this.incrementQualityByAmount(item, 2);
killedBy: Gilded Rose Backstage passes quality drops to 0 when sell in value is below 0
statusReason: expected 13 to equal +0

[Killed] EqualityOperator
src/gilded_rose.mjs:36:15
           break;
 
         case "Backstage passes to a TAFKAL80ETC concert":
-          if (item.sellIn <= 0) item.quality = 0
+          if (item.sellIn < 0) item.quality = 0
           else if (item.sellIn <= 5) this.incrementQualityByAmount(item, 3);
           else if (item.sellIn <= 10) this.incrementQualityByAmount(item, 2);
killedBy: Gilded Rose Backstage passes quality drops to 0 when sell in value is below 0
statusReason: expected 13 to equal +0

[Killed] EqualityOperator
src/gilded_rose.mjs:37:20
 
         case "Backstage passes to a TAFKAL80ETC concert":
           if (item.sellIn <= 0) item.quality = 0
-          else if (item.sellIn <= 5) this.incrementQualityByAmount(item, 3);
+          else if (item.sellIn < 5) this.incrementQualityByAmount(item, 3);
           else if (item.sellIn <= 10) this.incrementQualityByAmount(item, 2);
           else this.incrementQualityByAmount(item, 1);
killedBy: Gilded Rose Backstage passes quality increases by 3 per day when the sell in value is less than 5
statusReason: expected 12 to equal 13

[Killed] ConditionalExpression
src/gilded_rose.mjs:37:20
 
         case "Backstage passes to a TAFKAL80ETC concert":
           if (item.sellIn <= 0) item.quality = 0
-          else if (item.sellIn <= 5) this.incrementQualityByAmount(item, 3);
+          else if (false) this.incrementQualityByAmount(item, 3);
           else if (item.sellIn <= 10) this.incrementQualityByAmount(item, 2);
           else this.incrementQualityByAmount(item, 1);
killedBy: Gilded Rose Backstage passes quality increases by 3 per day when the sell in value is less than 5
statusReason: expected 12 to equal 13

[Killed] EqualityOperator
src/gilded_rose.mjs:38:20
         case "Backstage passes to a TAFKAL80ETC concert":
           if (item.sellIn <= 0) item.quality = 0
           else if (item.sellIn <= 5) this.incrementQualityByAmount(item, 3);
-          else if (item.sellIn <= 10) this.incrementQualityByAmount(item, 2);
+          else if (item.sellIn < 10) this.incrementQualityByAmount(item, 2);
           else this.incrementQualityByAmount(item, 1);
           break;
killedBy: Gilded Rose Backstage passes quality increases by 2 per day when the sell in value is between 5 and 10
statusReason: expected 11 to equal 12

[Killed] EqualityOperator
src/gilded_rose.mjs:38:20
         case "Backstage passes to a TAFKAL80ETC concert":
           if (item.sellIn <= 0) item.quality = 0
           else if (item.sellIn <= 5) this.incrementQualityByAmount(item, 3);
-          else if (item.sellIn <= 10) this.incrementQualityByAmount(item, 2);
+          else if (item.sellIn > 10) this.incrementQualityByAmount(item, 2);
           else this.incrementQualityByAmount(item, 1);
           break;
killedBy: Gilded Rose Backstage passes quality increases by 1 per day when the sell in value is more that 10
statusReason: expected 12 to equal 11

[Killed] ConditionalExpression
src/gilded_rose.mjs:42:9
           else this.incrementQualityByAmount(item, 1);
           break;
 
-        case "Aged Brie":
-          this.incrementQualityByAmount(item, 1);
-          break;
+        case "Aged Brie":
 
         default:
killedBy: Gilded Rose Aged Brie quality value increases by 1 per day
statusReason: expected 9 to equal 11

[Killed] ConditionalExpression
src/gilded_rose.mjs:46:9
           this.incrementQualityByAmount(item, 1);
           break;
 
-        default:
-          if (item.conjured) {
-            if (item.sellIn <= 0) this.decrementQualityByAmount(item, 4);
-            else this.decrementQualityByAmount(item, 2);
-
-          } else {
-            if (item.sellIn <= 0) this.decrementQualityByAmount(item, 2);
-            else this.decrementQualityByAmount(item, 1);
-          }
-          break;
+        default:
       }
 
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 10 to equal 9

[Killed] ConditionalExpression
src/gilded_rose.mjs:47:15
           break;
 
         default:
-          if (item.conjured) {
+          if (true) {
             if (item.sellIn <= 0) this.decrementQualityByAmount(item, 4);
             else this.decrementQualityByAmount(item, 2);
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 8 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:47:30
           break;
 
         default:
-          if (item.conjured) {
-            if (item.sellIn <= 0) this.decrementQualityByAmount(item, 4);
-            else this.decrementQualityByAmount(item, 2);
-
-          } else {
+          if (item.conjured) {} else {
             if (item.sellIn <= 0) this.decrementQualityByAmount(item, 2);
             else this.decrementQualityByAmount(item, 1);
killedBy: Gilded Rose Conjured item quality decreases by 2 per day when sell in value is above 0
statusReason: expected 10 to equal 8

[Killed] EqualityOperator
src/gilded_rose.mjs:48:17
 
         default:
           if (item.conjured) {
-            if (item.sellIn <= 0) this.decrementQualityByAmount(item, 4);
+            if (item.sellIn < 0) this.decrementQualityByAmount(item, 4);
             else this.decrementQualityByAmount(item, 2);
 
killedBy: Gilded Rose Conjured item quality decreases by 4 per day when sell in value is below 0
statusReason: expected 8 to equal 6

[Killed] ConditionalExpression
src/gilded_rose.mjs:48:17
 
         default:
           if (item.conjured) {
-            if (item.sellIn <= 0) this.decrementQualityByAmount(item, 4);
+            if (true) this.decrementQualityByAmount(item, 4);
             else this.decrementQualityByAmount(item, 2);
 
killedBy: Gilded Rose Conjured item quality decreases by 2 per day when sell in value is above 0
statusReason: expected 6 to equal 8

[Killed] BlockStatement
src/gilded_rose.mjs:51:18
             if (item.sellIn <= 0) this.decrementQualityByAmount(item, 4);
             else this.decrementQualityByAmount(item, 2);
 
-          } else {
-            if (item.sellIn <= 0) this.decrementQualityByAmount(item, 2);
-            else this.decrementQualityByAmount(item, 1);
-          }
+          } else {}
           break;
       }
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 10 to equal 9

[Killed] ConditionalExpression
src/gilded_rose.mjs:52:17
             else this.decrementQualityByAmount(item, 2);
 
           } else {
-            if (item.sellIn <= 0) this.decrementQualityByAmount(item, 2);
+            if (true) this.decrementQualityByAmount(item, 2);
             else this.decrementQualityByAmount(item, 1);
           }
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 8 to equal 9

[Killed] ConditionalExpression
src/gilded_rose.mjs:52:17
             else this.decrementQualityByAmount(item, 2);
 
           } else {
-            if (item.sellIn <= 0) this.decrementQualityByAmount(item, 2);
+            if (false) this.decrementQualityByAmount(item, 2);
             else this.decrementQualityByAmount(item, 1);
           }
killedBy: Gilded Rose item quality value decreases by 2 per day after sell in date has passed
statusReason: expected 9 to equal 8

[Killed] ConditionalExpression
src/gilded_rose.mjs:58:11
           break;
       }
 
-      if (item.name !== "Sulfuras, Hand of Ragnaros") {
+      if (false) {
         this.decrementSellIn(item);
       }
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 10 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:58:55
           break;
       }
 
-      if (item.name !== "Sulfuras, Hand of Ragnaros") {
-        this.decrementSellIn(item);
-      }
+      if (item.name !== "Sulfuras, Hand of Ragnaros") {}
     }
 
killedBy: Gilded Rose item sell in and quality values should decrease by 1 per day
statusReason: expected 10 to equal 9
